pgbench/c5d-metal/ro-256.txt
pgbench (14.5)
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 256
number of threads: 256
duration: 180 s
number of transactions actually processed: 119064471
latency average = 0.386 ms
latency stddev = 0.252 ms
initial connection time = 492.625 ms
tps = 662552.682117 (without initial connection time)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.426  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;