pgbench/c5d-metal/ro-384.txt
pgbench (14.5)
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 384
number of threads: 384
duration: 180 s
number of transactions actually processed: 116194020
latency average = 0.592 ms
latency stddev = 0.397 ms
initial connection time = 705.272 ms
tps = 646750.562955 (without initial connection time)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.623  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;